InformationRegisters/ТарифныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСтавки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДополнительныеРазрезыТарифнойСетки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДополнительныеРазрезыТарифнойСетки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезДетализации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ТарифныеСтавки/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ВидРабот, "Должность");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Должность",
		Должность,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(Должность));
		
	Заголовок = СтрШаблон(НСтр("ru = 'Тарифные ставки должности %1';
								|en = '%1 position tariff rates'"), Должность);
	
	ДопРазрез = Константы.ДополнительныйРазрезТарифнойСетки.Получить();
	
	Элементы.Подразделение.Видимость = ДопРазрез = Перечисления.ДополнительныеРазрезыТарифнойСетки.Подразделение;
	Элементы.Организация.Видимость = ДопРазрез = Перечисления.ДополнительныеРазрезыТарифнойСетки.Организация;
	
	Если ДопРазрез = Перечисления.ДополнительныеРазрезыТарифнойСетки.Подразделение Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Организация",
			,
			ВидСравненияКомпоновкиДанных.НеЗаполнено,
			,
			Истина);
	ИначеЕсли ДопРазрез = Перечисления.ДополнительныеРазрезыТарифнойСетки.Организация Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Подразделение",
			,
			ВидСравненияКомпоновкиДанных.НеЗаполнено,
			,
			Истина);
	ИначеЕсли ДопРазрез = Перечисления.ДополнительныеРазрезыТарифнойСетки.БезДетализации Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Подразделение",
			,
			ВидСравненияКомпоновкиДанных.НеЗаполнено,
			,
			Истина);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Организация",
			,
			ВидСравненияКомпоновкиДанных.НеЗаполнено,
			,
			Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Документ.РегистраторТарифнойСетки.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.Регистратор));
	
КонецПроцедуры

#КонецОбласти
